docs/DIAGRAM_GUIDE.md
```plantuml
@startuml
!include plantuml_options.txt

participant Browser
participant "ASGI Server"
participant FastAPI
participant Starlette
participant Middleware
participant router
participant Controller
participant Service
participant Manager

note over "ASGI Server", router: Framework
note over Controller, Manager: Galaxy Backend

Browser -> "ASGI Server": TCP/IP Request
activate "ASGI Server"
"ASGI Server" -> FastAPI: asgi args
activate FastAPI

FastAPI -> Starlette: asgi args
activate Starlette

... (abbreviated) ...

Manager --> Service: pydantic
Service --> Controller: pydantic
Controller --> router: pydantic

@enduml
```
